/**
 * OSS 业务编码列表（用于 OssX 批量测试）
 * 格式：{ code, name }，code 用于 getCredentials({ bizCode })
 */
export const BIZCODE_LIST = [
  // 考勤模块
  { code: '010101', name: '考勤签到' },
  // 用户模块
  { code: '010201', name: '用户头像' },
  { code: '010202', name: '用户信息导入' },
  { code: '010203', name: '门店信息导入' },
  { code: '010204', name: '通知公告上传附件' },
  // 系统模块
  { code: '010205', name: 'web端logo上传 / app端logo上传' },
  { code: '010207', name: '问题反馈' },
  { code: '010208', name: '门店、员工证件' },
  // 课程模块
  { code: '010301', name: '内训课堂课程上传' },
  // 设备模块
  { code: '010401', name: '设备通道封面图' },
  { code: '010402', name: '直播间封面图' },
  { code: '010403', name: '云存储' },
  { code: '010404', name: '控件初始化（控件抓图）' },
  // 人脸库模块
  { code: '010501', name: '人脸库人员信息导入' },
  { code: '010502', name: '人脸库图片-会员' },
  { code: '010503', name: '人脸库图片-员工' },
  { code: '010504', name: '人脸库图片-特殊人员' },
  // 热力分析模块
  { code: '010601', name: '热力分析-上传底图' },
  // 考评模块
  { code: '011101', name: '考评标准信息导入' },
  { code: '011102', name: '考评场景封面图、问题小项标准图等考评基础信息' },
  { code: '011103', name: '图片中心' },
  { code: '011104', name: '点检抓图' },
  { code: '011105', name: '计划考评抓图' },
  { code: '011101', name: '导入默认巡查人' },
  { code: '011107', name: '考评详情修改记录图片上传' },
  { code: '011108', name: '考评签到、签名' },
  { code: '011109', name: '巡查角色配置' },
  { code: '011110', name: '标准图素材转码' },
  { code: '011111', name: '申诉文件上传' },
  { code: '011112', name: '智能模板生成文件导入' },
  // POS模块
  { code: '011201', name: '导入标记订单 / 导入POS单' },
  // 工作日志模块
  { code: '011401', name: '工作日志信息导入' },
  { code: '011402', name: '工作日志图片' },
  // 会议平板模块
  { code: '011601', name: '会议平板文件' },
  // 店务模块
  { code: '011701', name: '店务标准图/视频' }
]
